Revit 2027 API
PaperSizeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PaperSizeSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As PaperSizeSetIterator
public:
virtual PaperSizeSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> PaperSizeSetIterator
override ForwardIterator : unit -> PaperSizeSetIterator
Return Value
PaperSizeSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
PaperSizeSet Class
Autodesk.Revit.DB Namespace